<template>
  <div>
    <page-header :HeaderRows="ClassRows"></page-header>
    <div v-for="helpMsg in HelpMsgs" :key="helpMsg.id">
      <detail-item :DetailMsg="helpMsg"></detail-item>
    </div>
  </div>
</template>

<script>
import DetailItem from '../../components/DetailItem.vue';
import PageHeader from '../../components/PageHeader.vue';

export default {
  data() {
    return {
      ClassRows: [
        {
          id: 0,
          name: '全部',
        },
        {
          id: 1,
          name: '寻物启事',
        },
        {
          id: 2,
          name: '失物招领',
        },
        {
          id: 3,
          name: '找队友',
        },
      ],
      HelpMsgs: [
        {
          id: 0,
          title: '家教 英语一定要好女孩子！！！家教 英语一定要好女孩子！！！',
          className: '找队友',
          detailMsg:
            '家教 英语一定要好女孩子！！！家教 英语一定要好女孩子！！！家教英语一定要好女孩子家教 英语一定要好女孩子！！！家教英语一定要好女孩子！！！家教 英语一定要好女孩子！！！家教英语一定要好女孩子！！！家教 英语一定要好女孩子！！！家教英语一定要好女孩子！！！家教 英语一定要好女孩子！！！家教英语一定要好女孩子！！！家教 英语一定要好女孩子！！！',
        },
        {
          id: 1,
          title: '家教 英语一定要好女孩子！！！家教 英语一定要好女孩子！！！',
          className: '寻物启事',
          detailMsg:
            '家教 英语一定要好女孩子！！！家教 英语一定要好女孩子！！！家教英语一定要好女孩子家教 英语一定要好女孩子！！！家教英语一定要好女孩子！！！家教 英语一定要好女孩子！！！家教英语一定要好女孩子！！！家教 英语一定要好女孩子！！！家教英语一定要好女孩子！！！家教 英语一定要好女孩子！！！家教英语一定要好女孩子！！！家教 英语一定要好女孩子！！！',
        },
        {
          id: 2,
          title: '家教 英语一定要好女孩子！！！家教 英语一定要好女孩子！！！',
          className: '失物招领',
          detailMsg:
            '家教 英语一定要好女孩子！！！家教 英语一定要好女孩子！！！家教英语一定要好女孩子家教 英语一定要好女孩子！！！家教英语一定要好女孩子！！！家教 英语一定要好女孩子！！！家教英语一定要好女孩子！！！家教 英语一定要好女孩子！！！家教英语一定要好女孩子！！！家教 英语一定要好女孩子！！！家教英语一定要好女孩子！！！家教 英语一定要好女孩子！！！',
        },
        {
          id: 3,
          title: '家教 英语一定要好女孩子！！！家教 英语一定要好女孩子！！！',
          className: '找队友',
          detailMsg:
            '家教 英语一定要好女孩子！！！家教 英语一定要好女孩子！！！家教英语一定要好女孩子家教 英语一定要好女孩子！！！家教英语一定要好女孩子！！！家教 英语一定要好女孩子！！！家教英语一定要好女孩子！！！家教 英语一定要好女孩子！！！家教英语一定要好女孩子！！！家教 英语一定要好女孩子！！！家教英语一定要好女孩子！！！家教 英语一定要好女孩子！！！',
        },
        {
          id: 4,
          title: '家教 英语一定要好女孩子！！！家教 英语一定要好女孩子！！！',
          className: '找队友',
          detailMsg:
            '家教 英语一定要好女孩子！！！家教 英语一定要好女孩子！！！家教英语一定要好女孩子家教 英语一定要好女孩子！！！家教英语一定要好女孩子！！！家教 英语一定要好女孩子！！！家教英语一定要好女孩子！！！家教 英语一定要好女孩子！！！家教英语一定要好女孩子！！！家教 英语一定要好女孩子！！！家教英语一定要好女孩子！！！家教 英语一定要好女孩子！！！',
        },
        {
          id: 5,
          title: '家教 英语一定要好女孩子！！！家教 英语一定要好女孩子！！！',
          className: '找队友',
          detailMsg:
            '家教 英语一定要好女孩子！！！家教 英语一定要好女孩子！！！家教英语一定要好女孩子家教 英语一定要好女孩子！！！家教英语一定要好女孩子！！！家教 英语一定要好女孩子！！！家教英语一定要好女孩子！！！家教 英语一定要好女孩子！！！家教英语一定要好女孩子！！！家教 英语一定要好女孩子！！！家教英语一定要好女孩子！！！家教 英语一定要好女孩子！！！',
        },
      ],
    };
  },
  components: {
    PageHeader,
    DetailItem,
  },
};
</script>

<style>
</style>
